# SQL Joins

## Introduction

A JOIN in SQL is used to combine data from two or more tables based on a related column.

In relational databases, data is typically stored across multiple tables to maintain structure and avoid duplication. Joins allow analysts to retrieve related information in a single query.

Joins are essential in data analysis for answering business questions that involve multiple datasets.

---

## Common Types of Joins

- **INNER JOIN** – Returns only matching records from both tables  
- **LEFT JOIN** – Returns all records from the left table and matching records from the right  
- **RIGHT JOIN** – Returns all records from the right table and matching records from the left  
- **FULL OUTER JOIN** – Returns all records from both tables  

---

## Basic Syntax

```sql
SELECT columns
FROM table1
JOIN table2
ON table1.key = table2.key;

### Database Connection

In [1]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:Bhavesh%402025@localhost/customers

### Database Testing

In [2]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('8.0.42',)]

### Creating the employees tables for performing Joins

In [37]:
%%sql
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT,
    department TEXT,
    role TEXT,
    salary INTEGER,
    joining_date DATE,
    city TEXT
);

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
0 rows affected.

[]

In [38]:
%%sql
insert into employees values
(1, 'Amit',   'IT',        'Data Analyst',        60000, '2022-01-15', 'Mumbai'),
(2, 'Neha',   'HR',        'HR Executive',        45000, '2021-07-10', 'Pune'),
(3, 'Rahul',  'IT',        'Data Scientist',      85000, '2020-03-20', 'Bangalore'),
(4, 'Priya',  'Finance',   'Accountant',          50000, '2022-11-01', 'Delhi'),
(5, 'Suresh', 'IT',        'Backend Engineer',    75000, '2019-06-18', 'Hyderabad'),
(6, 'Anita',  'Marketing', 'Marketing Manager',   55000, '2021-02-25', 'Mumbai'),
(7, 'Vikram', 'Finance',   'Financial Analyst',   65000, '2020-09-12', 'Chennai'),
(8, 'Rohit',  'Sales',     'Sales Executive',     48000, '2023-02-05', 'Delhi');

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
8 rows affected.

[]

In [44]:
%%sql
CREATE TABLE departments (
    department_id INTEGER PRIMARY KEY,
    department_name TEXT,
    manager_name TEXT
);

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
(pymysql.err.OperationalError) (1050, "Table 'departments' already exists")
[SQL: CREATE TABLE departments (
    department_id INTEGER PRIMARY KEY,
    department_name TEXT,
    manager_name TEXT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [45]:
%%sql
INSERT INTO departments VALUES
(1, 'IT',        'Rajesh Kumar'),
(2, 'HR',        'Sunita Sharma'),
(3, 'Finance',   'Meena Iyer'),
(4, 'Marketing', 'Aakash Verma'),
(5, 'Sales',     'Rohit Malhotra'),
(6, 'Operations','Nitin Rao');

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
(pymysql.err.IntegrityError) (1062, "Duplicate entry '1' for key 'departments.PRIMARY'")
[SQL: INSERT INTO departments VALUES
(1, 'IT',        'Rajesh Kumar'),
(2, 'HR',        'Sunita Sharma'),
(3, 'Finance',   'Meena Iyer'),
(4, 'Marketing', 'Aakash Verma'),
(5, 'Sales',     'Rohit Malhotra'),
(6, 'Operations','Nitin Rao');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [59]:
%%sql
CREATE TABLE salaries (
    employee_id INTEGER,
    bonus INTEGER
);

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
(pymysql.err.OperationalError) (1050, "Table 'salaries' already exists")
[SQL: CREATE TABLE salaries (
    employee_id INTEGER,
    bonus INTEGER
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [60]:
%%sql
INSERT INTO salaries VALUES
(1, 5000),
(3, 12000),
(5, 8000),
(6, 4000),
(7, 6000);

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
5 rows affected.

[]

## Inner Join

### Employees with their department manager

In [49]:
%%sql
select e.name,e.department,d.manager_name
from employees e 
inner join departments d 
on e.department = d.department_name;

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
8 rows affected.

[('Amit', 'IT', 'Rajesh Kumar'),
 ('Neha', 'HR', 'Sunita Sharma'),
 ('Rahul', 'IT', 'Rajesh Kumar'),
 ('Priya', 'Finance', 'Meena Iyer'),
 ('Suresh', 'IT', 'Rajesh Kumar'),
 ('Anita', 'Marketing', 'Aakash Verma'),
 ('Vikram', 'Finance', 'Meena Iyer'),
 ('Rohit', 'Sales', 'Rohit Malhotra')]

### Employees who received bonus

In [61]:
%%sql
select e.name,e.salary,s.bonus
from employees e 
inner join salaries s 
on e.employee_id=s.employee_id

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
5 rows affected.

[('Amit', 60000, 5000),
 ('Rahul', 85000, 12000),
 ('Suresh', 75000, 8000),
 ('Anita', 55000, 4000),
 ('Vikram', 65000, 6000)]

### Employees with bonus > 6000

In [62]:
%%sql 
select e.name,e.salary,s.bonus
from employees e 
inner join salaries s 
on e.employee_id=s.employee_id
where s.bonus>6000

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
2 rows affected.

[('Rahul', 85000, 12000), ('Suresh', 75000, 8000)]

## LEFT JOIN Queries

### All employees with bonus (if any)

In [64]:
%%sql 
select e.name,e.salary,s.bonus
from employees e 
left join salaries s 
on e.employee_id = s.employee_id

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
8 rows affected.

[('Amit', 60000, 5000),
 ('Neha', 45000, None),
 ('Rahul', 85000, 12000),
 ('Priya', 50000, None),
 ('Suresh', 75000, 8000),
 ('Anita', 55000, 4000),
 ('Vikram', 65000, 6000),
 ('Rohit', 48000, None)]

### Employees without bonus

In [65]:
%%sql
select e.name,e.salary,s.bonus
from employees e 
left join salaries s 
on e.employee_id = s.employee_id
where s.employee_id is null ;

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
3 rows affected.

[('Neha', 45000, None), ('Priya', 50000, None), ('Rohit', 48000, None)]

### Employees with manager names

In [67]:
%%sql
select e.name,d.manager_name
from employees e 
left join departments d 
on e.department=d.department_name

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
8 rows affected.

[('Amit', 'Rajesh Kumar'),
 ('Neha', 'Sunita Sharma'),
 ('Rahul', 'Rajesh Kumar'),
 ('Priya', 'Meena Iyer'),
 ('Suresh', 'Rajesh Kumar'),
 ('Anita', 'Aakash Verma'),
 ('Vikram', 'Meena Iyer'),
 ('Rohit', 'Rohit Malhotra')]

### RIGHT JOIN Queries

### All departments (even if no employees)

In [68]:
%%sql 
select e.name,d.department_name 
from employees e 
right join departments d 
on e.department = d.department_name

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
9 rows affected.

[('Suresh', 'IT'),
 ('Rahul', 'IT'),
 ('Amit', 'IT'),
 ('Neha', 'HR'),
 ('Vikram', 'Finance'),
 ('Priya', 'Finance'),
 ('Anita', 'Marketing'),
 ('Rohit', 'Sales'),
 (None, 'Operations')]

### All bonus records (even if employee missing)

In [79]:
%%sql
select e.name,s.bonus
from employees e 
right join salaries s 
on e.employee_id = s.employee_id

 * mysql+pymysql://root:***@localhost/customers
   mysql+pymysql://root:***@localhost/employee
5 rows affected.

[('Amit', 5000),
 ('Rahul', 12000),
 ('Suresh', 8000),
 ('Anita', 4000),
 ('Vikram', 6000)]

### FULL JOIN Queries
### *note-* full join is not work in my sql

### Complete employee–bonus mapping

In [34]:
%%sql
select e.name,s.bonus
from employees e 
full outer join salaries s 
on e.employee_id = s.employee_id

 * mysql+pymysql://root:***@localhost/customers
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'full outer join salaries s \non e.employee_id = s.employee_id' at line 3")
[SQL: select e.name,s.bonus
from employees e
full outer join salaries s
on e.employee_id = s.employee_id]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [32]:
%%sql
SELECT e.name, s.bonus
FROM employees e
FULL JOIN salaries s
ON e.employee_id = s.employee_id

 * mysql+pymysql://root:***@localhost/customers
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FULL JOIN salaries s\nON e.employee_id = s.employee_id' at line 3")
[SQL: SELECT e.name, s.bonus
FROM employees e
FULL JOIN salaries s
ON e.employee_id = s.employee_id]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Employees + Departments (Full coverage)

In [4]:
%%sql 
select e.name,d.department_name 
from employees e 
full join departments d
on e.department = d.department_name

 * mysql+pymysql://root:***@localhost/customers
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'full join departments d\non e.department = d.department_name' at line 3")
[SQL: select e.name,d.department_name
from employees e
full join departments d
on e.department = d.department_name]
(Background on this error at: https://sqlalche.me/e/20/f405)

### SELF JOIN Queries

### Employees working in same city

In [7]:
%%sql 
select e1.name AS employee1,
       e2.name AS employee2,
       e1.city
from employees e1
join employees e2
on e1.city = e2.city
and e1.employee_id <> e2.employee_id;

 * mysql+pymysql://root:***@localhost/customers
4 rows affected.

[('Anita', 'Amit', 'Mumbai'),
 ('Rohit', 'Priya', 'Delhi'),
 ('Amit', 'Anita', 'Mumbai'),
 ('Priya', 'Rohit', 'Delhi')]

### Employees in same department

In [14]:
%%sql
select e1.name as employee1,
e2.name as employee2,
e1.department
from employees  e1 
join employees   e2
on e1.department = e2.department
and e1.employee_id<>e2.employee_id ;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Suresh', 'Amit', 'IT'),
 ('Rahul', 'Amit', 'IT'),
 ('Suresh', 'Rahul', 'IT'),
 ('Amit', 'Rahul', 'IT'),
 ('Vikram', 'Priya', 'Finance'),
 ('Rahul', 'Suresh', 'IT'),
 ('Amit', 'Suresh', 'IT'),
 ('Priya', 'Vikram', 'Finance')]

### Multi-Table JOIN Queries

### Employee + Manager + Bonus

In [19]:
%%sql 
select e.name,e.department,
d.manager_name, 
s.bonus
from employees e 
left join departments d 
on e.department=d.department_name
left join salaries s 
on e.employee_id = s.employee_id

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 'IT', 'Rajesh Kumar', 5000),
 ('Neha', 'HR', 'Sunita Sharma', None),
 ('Rahul', 'IT', 'Rajesh Kumar', 12000),
 ('Priya', 'Finance', 'Meena Iyer', None),
 ('Suresh', 'IT', 'Rajesh Kumar', 8000),
 ('Anita', 'Marketing', 'Aakash Verma', 4000),
 ('Vikram', 'Finance', 'Meena Iyer', 6000),
 ('Rohit', 'Sales', 'Rohit Malhotra', None)]

### Total compannsaction (Salary + bonus )

In [21]:
%%sql
SELECT e.name,
       e.salary,
       COALESCE(s.bonus, 0) AS bonus,
       e.salary + COALESCE(s.bonus, 0) AS total_compensation
FROM employees e
LEFT JOIN salaries s
ON e.employee_id = s.employee_id;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 60000, 5000, 65000),
 ('Neha', 45000, 0, 45000),
 ('Rahul', 85000, 12000, 97000),
 ('Priya', 50000, 0, 50000),
 ('Suresh', 75000, 8000, 83000),
 ('Anita', 55000, 4000, 59000),
 ('Vikram', 65000, 6000, 71000),
 ('Rohit', 48000, 0, 48000)]

### Department-wise Total Bonus

In [23]:
%%sql 
select e.department,
sum(coalesce(s.bonus,0)) as total_bonus 
from employees e 
left join salaries s 
on e.employee_id = s.employee_id
group by e.department;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('IT', Decimal('25000')),
 ('HR', Decimal('0')),
 ('Finance', Decimal('6000')),
 ('Marketing', Decimal('4000')),
 ('Sales', Decimal('0'))]

### Top 3 Highest Paid Employees with Manager

In [25]:
%%sql
SELECT e.name,
       e.salary,
       d.manager_name
FROM employees e
LEFT JOIN departments d
ON e.department = d.department_name
ORDER BY e.salary DESC
LIMIT 3;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Rahul', 85000, 'Rajesh Kumar'),
 ('Suresh', 75000, 'Rajesh Kumar'),
 ('Vikram', 65000, 'Meena Iyer')]

### Advanced Analysis JOIN Queries

### Departments with No Employees

In [26]:
%%sql 
select d.department_name
from departments d 
left join employees e 
on d.department_name=e.department 
where e.employee_id is null;

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('Operations',)]

### Employees earning above department average

In [27]:
%%sql
SELECT e.name, e.salary, e.department
FROM employees e
JOIN (
    SELECT department, AVG(salary) AS avg_salary
    FROM employees
    GROUP BY department
) dept_avg
ON e.department = dept_avg.department
WHERE e.salary > dept_avg.avg_salary;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Suresh', 75000, 'IT'), ('Rahul', 85000, 'IT'), ('Vikram', 65000, 'Finance')]